{
  "backend/main.mo": "Motoko canister implementing user profiles, public profiles, events, chat messages, access control, and approval workflows with state management and helper authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to frontend file paths, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short summaries describing their purpose and behavior.",
  "frontend/index.css": "TailwindCSS base file defining theme variables, dark mode values, and global styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the application's TanStack Router setup, route tree, and layout wrapped in AppShell.",
  "frontend/src/components/admin/ChatModerationPanel.tsx": "Admin UI component for reviewing, approving, and removing chat messages with loading states and toast notifications.",
  "frontend/src/components/admin/EventsManager.tsx": "Admin UI to list, create, and delete events using event-related hooks with form dialogs and toast feedback.",
  "frontend/src/components/admin/ProfileValidationControls.tsx": "Displays public profiles and allows admins to toggle validation status with mutation calls and badges.",
  "frontend/src/components/admin/PublicProfileEditor.tsx": "Editor for selecting a user profile and updating its fields via a create-or-update mutation.",
  "frontend/src/components/admin/StatisticsPanel.tsx": "Fetches and displays aggregate admin statistics in a grid of metric cards.",
  "frontend/src/components/auth/LoginButton.tsx": "Sign-in/sign-out button using Internet Identity with loading state and error handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that checks admin status and blocks access with an error card if the caller is not an admin.",
  "frontend/src/components/auth/RequireAuth.tsx": "Redirects unauthenticated users to home and shows a sign-in card until authentication.",
  "frontend/src/components/auth/RequireOnboarding.tsx": "Redirects authenticated users to onboarding if their profile isn't complete and waits for profile load.",
  "frontend/src/components/chat/VoteButton.tsx": "Button to vote on chat messages, calling vote mutation and handling duplicate-vote errors.",
  "frontend/src/components/landing/SponsorsSection.tsx": "Static sponsors list rendered as cards linking to external sponsor websites.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout component managing header, navigation, auth state, and onboarding gating.",
  "frontend/src/components/system/InitializationBanner.tsx": "Displays initialization slow/error banners with retry and reload actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks to check admin status and fetch admin statistics via the actor.",
  "frontend/src/hooks/useAuthState.ts": "Exposes basic authentication state derived from Internet Identity.",
  "frontend/src/hooks/useChat.ts": "Hooks for fetching, posting, voting, approving, and removing chat messages with query invalidation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the authenticated user's profile from the backend with loading/error handling.",
  "frontend/src/hooks/useEvents.ts": "Hooks for listing, fetching, creating, updating, deleting, and RSVPing to events via the actor.",
  "frontend/src/hooks/useInitializationWatchdog.ts": "Watches auth, actor, and profile initialization for slow or error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useLeaderboard.ts": "Provides a React Query hook to fetch the leaderboard from the backend actor when available.",
  "frontend/src/hooks/usePublicProfiles.ts": "Defines React Query hooks for listing, fetching, creating/updating, and validating public profiles via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains mutation hooks for user registration, onboarding completion, and saving the caller's user profile.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor tied to the current identity with background admin initialization and exposes loading states.",
  "frontend/src/index.css": "Imports the project's base CSS file.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabbed panels for stats, profiles, public profiles, events, and chat management.",
  "frontend/src/pages/ChatPage.tsx": "Displays the community guestbook with message posting and a feed of approved messages.",
  "frontend/src/pages/CommunityDirectoryPage.tsx": "Shows a directory of public profiles with validation indicators and links to detailed views.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays detailed event information and allows authenticated users to RSVP.",
  "frontend/src/pages/EventsListPage.tsx": "Displays a list of community events with loading, empty, and populated states, requiring authentication and onboarding.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing hero content, feature cards, sponsors, and redirects authenticated users based on onboarding status.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows the community leaderboard with ranked contributors, load/error handling, and auth/onboarding enforcement.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows users to view and edit their profile, see points, and handle loading, errors, and completion status.",
  "frontend/src/pages/OnboardingPage.tsx": "Guides authenticated users through registration and onboarding steps with profile checks and navigation logic.",
  "frontend/src/pages/PartnersPage.tsx": "Renders a list of partner organizations with logos, descriptions, and outbound links.",
  "frontend/src/pages/PublicProfilePage.tsx": "Renders a public profile page with authentication and onboarding guards, fetching a profile by principal and displaying company info, biography, services, and links.",
  "frontend/src/utils/linkParsing.ts": "Provides utilities to validate URLs, extract valid URLs from text, and generate display-friendly labels from URLs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters, supporting both query and hash routing plus sessionStorage persistence.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, typography, and container settings for the frontend.",
  "project_state.json": "Describes the project’s state, app goals, architecture, issues, and existing implemented features for the NG COIN ICP application."
}