{
  "backend/main.mo": "Motoko canister implementing user profiles, events, chat, authorization, approvals, and related state with helper validation and access checks.",
  "feature_evidence.json": "Feature evidence report describing the admin-only Profile Management navigation entry and associated file references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend source files for documentation or planning.",
  "frontend/index.css": "Tailwind CSS base/theme configuration defining light and dark mode variables and global styles.",
  "frontend/index.html": "Minimal HTML entry point loading the React frontend via main.tsx.",
  "frontend/scripts/frontend-build-check.sh": "Shell script performing TypeScript checks and a Vite production build to validate frontend health.",
  "frontend/scripts/README.md": "Documentation explaining frontend build verification scripts and usage.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and renders the application inside the AppShell layout.",
  "frontend/src/components/admin/ChatModerationPanel.tsx": "Admin panel for listing, approving, and removing chat messages with mutation hooks and UI controls.",
  "frontend/src/components/admin/EventsManager.tsx": "Admin interface for creating, editing, and deleting events using associated React Query hooks.",
  "frontend/src/components/admin/ProfileValidationControls.tsx": "Lists public profiles and lets admins toggle validation status with mutation calls and toast feedback.",
  "frontend/src/components/admin/PublicProfileEditor.tsx": "Provides a form for admins to select and edit public profile fields and submit updates.",
  "frontend/src/components/admin/StatisticsPanel.tsx": "Displays admin statistics such as totals for users, messages, events, and points in card widgets.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login and logout flows with UI feedback and retry logic.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Blocks access to children unless the caller is an admin, showing an access‑denied card otherwise.",
  "frontend/src/components/auth/RequireAuth.tsx": "Redirects unauthenticated users to home and shows a sign‑in prompt until authenticated.",
  "frontend/src/components/auth/RequireOnboarding.tsx": "Redirects authenticated users without completed onboarding to the onboarding page and blocks content until loaded.",
  "frontend/src/components/chat/VoteButton.tsx": "Provides a button to vote on chat messages, triggering a vote mutation and toast responses.",
  "frontend/src/components/landing/SponsorsSection.tsx": "Shows a grid of sponsor cards with links to their external websites.",
  "frontend/src/components/layout/AppShell.tsx": "Renders the main navigation shell with dynamic menus based on auth, onboarding, and admin status.",
  "frontend/src/components/system/InitializationBanner.tsx": "Displays initialization slow/error states and offers retry or reload actions based on actor, auth, and profile status.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks to check admin status and fetch system statistics using the safe actor.",
  "frontend/src/hooks/useAuthState.ts": "Returns authentication state including principal, identity, and login status from Internet Identity.",
  "frontend/src/hooks/useChat.ts": "Provides chat message queries and mutations, auto-refetching and invalidating related message and profile queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller's private user profile with graceful handling of authorization-related null states.",
  "frontend/src/hooks/useEvents.ts": "Exposes event listing, details, and CRUD/RSVP mutations with appropriate query invalidation.",
  "frontend/src/hooks/useInitializationWatchdog.ts": "Detects slow or failed auth, actor creation, and profile loading, returning flags for initialization status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLeaderboard.ts": "Fetches the leaderboard of principals and scores using the safe actor.",
  "frontend/src/hooks/usePublicProfiles.ts": "Provides React Query hooks for listing, fetching, creating, updating, and validating public profiles using a backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation hooks for user registration, onboarding completion, and saving private user profiles, with cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "Creates and returns a backend actor tied to the user's identity with safe initialization and caching via React Query.",
  "frontend/src/index.css": "Imports global stylesheet from the parent directory.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabbed navigation for stats, profile management, events, and chat moderation.",
  "frontend/src/pages/ChatPage.tsx": "Displays a community chat interface allowing authenticated users to post messages and view the approved message feed.",
  "frontend/src/pages/CommunityDirectoryPage.tsx": "Shows a grid-style directory of public profiles with loading states and links to individual profile pages.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays event details, participation stats, and allows authenticated users to RSVP to an event.",
  "frontend/src/pages/EventsListPage.tsx": "Displays a list of community events with loading and empty states, requiring authentication and onboarding.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showing features and sponsors, redirecting authenticated users based on onboarding status.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a ranked leaderboard of users by points with icons for top ranks, gated by auth and onboarding.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows users to view and edit their private profile, handling onboarding prompts, loading, and error states.",
  "frontend/src/pages/OnboardingPage.tsx": "Guides authenticated users through registration and onboarding steps with profile checks and redirects.",
  "frontend/src/pages/PartnersPage.tsx": "Displays partner organizations with logos, descriptions, and external links.",
  "frontend/src/pages/PublicProfilePage.tsx": "Renders a public profile page that loads a user profile, shows validation status, biography, services, and social links, and wraps content with auth and onboarding requirements.",
  "frontend/src/utils/linkParsing.ts": "Provides helpers to validate URLs, extract them from text, and generate display labels based on domain names.",
  "frontend/src/utils/profileDisplay.ts": "Generates profile display strings including name, initial, and secondary text based on available profile fields.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radius, fonts, and animations while enabling plugins like typography and container queries.",
  "frontend/tsconfig.node.json": "TypeScript config for Node‑side tooling with ESNext modules and bundler resolution, targeting vite.config.ts.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variable injection, path aliases, chunk splitting, API proxying, and build settings.",
  "project_state.json": "Stores project metadata including version, goals, architecture notes, known issues, and implemented features for the NG COIN app."
}