{
  "backend/main.mo": "Backend actor storing user profiles, events, chat messages, approvals, and access control with helpers enforcing onboarding and registration.",
  "feature_evidence.json": "Defines feature-evidence metadata mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains short summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Defines Tailwind CSS base layers and design tokens for light and dark themes.",
  "frontend/index.html": "Root HTML file that mounts the frontend app and loads the main TypeScript entrypoint.",
  "frontend/scripts/frontend-build-check.sh": "Shell script that runs TypeScript type checking and a Vite production build to verify frontend health.",
  "frontend/scripts/README.md": "Explains the purpose and usage of frontend build-check scripts.",
  "frontend/src/App.tsx": "Sets up TanStack Router and application routes wrapped in the AppShell layout.",
  "frontend/src/components/admin/ChatModerationPanel.tsx": "Admin panel for approving and deleting chat messages using chat mutations with confirmation and toast feedback.",
  "frontend/src/components/admin/EventsManager.tsx": "Provides an interface for listing, creating, and deleting community events using form dialogs and event management hooks.",
  "frontend/src/components/admin/ProfileValidationControls.tsx": "Displays public profiles and allows admins to toggle validation status with mutation actions and badges.",
  "frontend/src/components/admin/PublicProfileEditor.tsx": "Lets admins select a user profile and update fields like display name, company info, biography, and links.",
  "frontend/src/components/admin/StatisticsPanel.tsx": "Fetches platform statistics and displays totals for users, messages, events, and points in metric cards.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles user login and logout via Internet Identity, showing different button states based on authentication.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Blocks access to children unless the caller is an admin, showing a denial card when unauthorized.",
  "frontend/src/components/auth/RequireAuth.tsx": "Redirects unauthenticated users to home and displays a sign‑in prompt card when access is restricted.",
  "frontend/src/components/auth/RequireOnboarding.tsx": "Redirects authenticated users to onboarding if their profile is incomplete, showing a loader during checks.",
  "frontend/src/components/chat/VoteButton.tsx": "Allows users to vote on chat messages, triggering a mutation and showing success or error toasts.",
  "frontend/src/components/landing/SponsorsSection.tsx": "Renders a grid of sponsor cards with external links for more information.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout and navigation menu, showing items based on auth, onboarding, and admin state, with mobile support and initialization warnings.",
  "frontend/src/components/system/InitializationBanner.tsx": "Displays slow-loading or error banners during initialization and provides retry or reload actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks to check admin status and fetch site statistics using the safe actor.",
  "frontend/src/hooks/useAuthState.ts": "Exposes basic authentication state derived from Internet Identity, including principal and login status.",
  "frontend/src/hooks/useChat.ts": "Implements chat message queries and mutations with refetching, optimistic updates, and profile updates.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s private user profile with special handling for authorization-related errors.",
  "frontend/src/hooks/useEvents.ts": "Provides queries and mutations for listing, retrieving, creating, updating, deleting, and RSVPing to events.",
  "frontend/src/hooks/useInitializationWatchdog.ts": "Tracks slow or failed initialization steps for auth, actor setup, and profile loading, producing status flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity loading states.",
  "frontend/src/hooks/useLeaderboard.ts": "Fetches leaderboard data from the backend actor using react-query.",
  "frontend/src/hooks/usePublicProfiles.ts": "Provides hooks to list, fetch, create/update, and validate public profiles via the backend actor with query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations for user registration, onboarding completion, and saving private user profiles.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor tied to the current identity with background admin initialization and safe loading via react-query.",
  "frontend/src/index.css": "Imports global stylesheet from the parent directory.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabbed navigation for statistics, profiles, public profiles, events, and chat management.",
  "frontend/src/pages/ChatPage.tsx": "Displays the community guestbook, allowing users to post, view, and delete messages with authentication and onboarding checks.",
  "frontend/src/pages/CommunityDirectoryPage.tsx": "Shows a directory of public user profiles with validation indicators and links to profile detail pages.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays event details, participation stats, and lets authenticated users RSVP with success and error handling.",
  "frontend/src/pages/EventsListPage.tsx": "Shows a grid of upcoming events with basic details and links to each event’s detail page.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero content, feature highlights, and redirects authenticated users to onboarding or community.",
  "frontend/src/pages/LeaderboardPage.tsx": "Fetches and displays a ranked leaderboard of users by points with icons for top positions.",
  "frontend/src/pages/MyProfilePage.tsx": "Loads the user’s private profile, allows editing and saving, and handles onboarding or error states.",
  "frontend/src/pages/OnboardingPage.tsx": "Guides authenticated users through registration and onboarding steps, with error handling and redirects.",
  "frontend/src/pages/PartnersPage.tsx": "Displays a grid of partner cards with logos, descriptions, and external links using card and button UI components.",
  "frontend/src/pages/PublicProfilePage.tsx": "Fetches and displays a public profile with header, biography, services, and social links, including loading and not-found states with auth/onboarding gating.",
  "frontend/src/utils/linkParsing.ts": "Provides URL validation, extraction, and label formatting utilities for profile text fields.",
  "frontend/src/utils/profileDisplay.ts": "Generates display name, initials, and secondary text for public profiles based on available fields.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins for the frontend.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variable injection, path aliases, optimized builds, and a dev server proxy.",
  "project_state.json": "Project metadata describing NG COIN’s architecture, feature set, known issues, and current development state."
}