{
  "backend/main.mo": "Motoko canister implementing user profiles, public profiles, events, chat messages, approvals, access control, and related state and helper logic.",
  "feature_evidence.json": "Feature evidence report mapping navigation-related requirements to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including hooks, components, and pages.",
  "frontend/index.css": "Global Tailwind CSS config defining color variables, dark mode theming, and base element styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and layout while handling authentication and profile-loading initialization states.",
  "frontend/src/components/admin/ChatModerationPanel.tsx": "Admin UI for approving and removing chat messages with loading and error handling.",
  "frontend/src/components/admin/EventsManager.tsx": "Admin interface for listing, creating, updating, and deleting events with dialog-based forms and mutations.",
  "frontend/src/components/admin/ProfileValidationControls.tsx": "Lists public profiles and lets admins toggle validation status with UI feedback.",
  "frontend/src/components/admin/PublicProfileEditor.tsx": "Allows admins to select a user and edit their public profile fields, saving changes via mutation.",
  "frontend/src/components/admin/StatisticsPanel.tsx": "Displays admin statistics such as totals for users, messages, events, and points.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout flow and displays corresponding button states.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Restricts access to admin-only areas and shows an access denied message if unauthorized.",
  "frontend/src/components/auth/RequireAuth.tsx": "Redirects unauthenticated users to home and displays a sign‑in prompt when needed.",
  "frontend/src/components/auth/RequireOnboarding.tsx": "Redirects authenticated users to onboarding until their profile is marked complete.",
  "frontend/src/components/chat/VoteButton.tsx": "Provides a button to vote on chat messages and handles duplicate or failed votes.",
  "frontend/src/components/landing/SponsorsSection.tsx": "Renders a grid of sponsor cards linking to external sponsor websites.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with header, navigation, auth-aware links, and branding.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor bound to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks to check admin status and fetch site statistics through the actor API.",
  "frontend/src/hooks/useAuthState.ts": "Derives authentication state and principal from the Internet Identity hook.",
  "frontend/src/hooks/useChat.ts": "Defines hooks for fetching, posting, voting, approving, and removing chat messages with automatic cache updates.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the authenticated caller’s user profile with auth and actor gating.",
  "frontend/src/hooks/useEvents.ts": "Provides event CRUD and RSVP hooks with query invalidation for live updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, state management, and identity loading.",
  "frontend/src/hooks/useLeaderboard.ts": "Retrieves the leaderboard of principals and their point totals.",
  "frontend/src/hooks/usePublicProfiles.ts": "Provides hooks to list, fetch, update, and validate public profiles.",
  "frontend/src/hooks/useQueries.ts": "Contains user-related mutations for registration, onboarding, and profile saving.",
  "frontend/src/index.css": "Re-exports global stylesheet from the parent directory.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for stats, profiles, events, and chat moderation.",
  "frontend/src/pages/ChatPage.tsx": "Displays the community chat feed and message posting interface with auth and onboarding checks.",
  "frontend/src/pages/CommunityDirectoryPage.tsx": "Displays a directory of public community profiles with loading, empty, and grid views, requiring authentication and onboarding.",
  "frontend/src/pages/EventDetailPage.tsx": "Shows detailed event information with RSVP handling, participation stats, and loading/error states.",
  "frontend/src/pages/EventsListPage.tsx": "Lists all community events with basic details, RSVP counts, and navigation to individual event pages.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with authentication redirects, feature highlights, a hero section, and sponsor display.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a ranked leaderboard of top contributors with icons for top positions and loading/empty states.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows users to view points and edit private profile data with form handling and profile update mutation.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles user registration and onboarding flow, showing project info and completing onboarding before redirecting to profile or community pages.",
  "frontend/src/pages/PartnersPage.tsx": "Displays a grid of partner organizations with logos, descriptions, and external links.",
  "frontend/src/pages/PublicProfilePage.tsx": "Fetches and displays a public user profile with biography, services, validation badge, and external links; handles loading and missing profiles.",
  "frontend/src/utils/linkParsing.ts": "Provides helpers to validate URLs, extract URLs from text, and generate display labels for link domains.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters, including session persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Tracks project metadata, requirements, implemented features, and architectural notes for the NG COIN application."
}