{
  "kind": "build_request",
  "title": "Enable deleting Live Guestbook messages (author + admin)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-55",
      "text": "Update the backend chat message deletion logic so that a message can be deleted by (a) the admin principal or (b) the original message author; all other callers must be rejected with an English unauthorized error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "je veux pouvoir supprimer les message dans le live guestbook"
        ]
      },
      "acceptanceCriteria": [
        "When the caller is the admin, calling `removeMessage(messageId)` deletes the message.",
        "When the caller is the original author of the message, calling `removeMessage(messageId)` deletes the message.",
        "When the caller is neither admin nor the message author, `removeMessage(messageId)` traps/rejects with an English error indicating the action is not allowed.",
        "Attempting to delete a non-existent message returns a clear English error (trap/reject) rather than silently succeeding."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Add a delete control to the Live Guestbook UI (`frontend/src/pages/ChatPage.tsx`) so authenticated, onboarded users can delete their own messages from the visible feed; the action must call the existing remove-message mutation and update the feed immediately after success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "je veux pouvoir supprimer les message dans le live guestbook"
        ]
      },
      "acceptanceCriteria": [
        "For each message in the guestbook feed, if the current user is the message author, a clearly visible delete button/control is shown.",
        "Clicking delete asks for confirmation (English) before performing the deletion.",
        "After a successful delete, the message disappears from the visible feed without requiring a manual page refresh.",
        "If deletion fails, the user sees an English error toast/message (e.g., 'Failed to delete message. Please try again.')."
      ]
    },
    {
      "id": "REQ-57",
      "text": "Ensure the existing admin chat moderation UI (`frontend/src/components/admin/ChatModerationPanel.tsx`) continues to support deleting any message after the backend authorization change, with the same English confirmation and success/error feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "je veux pouvoir supprimer les message dans le live guestbook"
        ]
      },
      "acceptanceCriteria": [
        "An admin can still remove any message via the moderation panel.",
        "The moderation panel’s delete action continues to refresh the message lists after success.",
        "No new authorization errors occur for admins when deleting messages."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Do not modify any frontend files under `frontend/src/components/ui` or other immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text (confirmations, buttons, toasts, and error messages)."
  ],
  "nonGoals": [
    "Do not add message editing functionality.",
    "Do not add soft-delete/history/restore behavior; deletion may remain a hard delete as it is today.",
    "Do not change the existing points rules related to posting/voting as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}