{
  "kind": "build_request",
  "title": "Add admin-only 'Profile Management' menu entry",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "Add an admin-only navigation menu entry labeled \"Profile Management\" in `frontend/src/components/layout/AppShell.tsx` that is visible to admins (same visibility rules as existing admin items) and navigates directly to the Admin Dashboard profile management area by opening `/admin?tab=profiles`. The entry must appear in both the desktop navigation and the mobile sheet menu, and the active-route highlighting must work when the current URL is `/admin?tab=profiles`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "je veux dans le menu en tant qu'admin la possibilité d'avoir un menu de gestion des profil"
        ]
      },
      "acceptanceCriteria": [
        "When signed in as an admin and onboarded, the main navigation shows a clickable \"Profile Management\" entry.",
        "Clicking \"Profile Management\" navigates to `/admin?tab=profiles` and the Admin Dashboard opens with the \"Profiles\" tab selected.",
        "The \"Profile Management\" entry is present and tappable in the mobile menu sheet as well as visible in the desktop navigation (consistent with existing menu behavior).",
        "When the current route is `/admin?tab=profiles`, the \"Profile Management\" menu entry is visually indicated as active.",
        "Non-admin users never see the \"Profile Management\" menu entry."
      ]
    }
  ],
  "constraints": [
    "Frontend user-facing labels must be in English.",
    "Do not edit any files under `frontend/src/components/ui` (shadcn components are read-only).",
    "Respect the existing role/onboarding gating logic in `AppShell.tsx` (public vs authenticated-not-onboarded vs onboarded vs admin)."
  ],
  "nonGoals": [
    "Do not change the Admin Dashboard tab structure or add new admin capabilities beyond providing a direct navigation entry to the existing profiles management tab.",
    "Do not modify backend data models or authorization logic for profiles as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}