{
  "kind": "build_request",
  "title": "Add header navigation links to Events and Live Guestbook (already implemented)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Add primary navigation links in the top header (AppShell) for onboarded, authenticated users, including direct links to the existing Events and Community Guestbook pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "il faut ajouter la fonction creation d'évènement et le live guestbook.\nSi c'est déjà le cas : ajoutes les liens en headers"
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated and has completed onboarding, the top header displays navigation links that include at least: “Events” (route: /events) and “Chat” (Community Guestbook; route: /chat).",
        "The header navigation uses English labels and is visually consistent with the existing navigation styling (active vs inactive state).",
        "When the user is not authenticated and/or not onboarded, these community navigation links do not appear in the header (current access rules remain unchanged)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Ensure header navigation remains responsive: on small screens, keep the existing bottom navigation behavior; on larger screens, header links should be visible without removing the existing desktop navigation unless it is intentionally replaced by the header links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Si c'est déjà le cas : ajoutes les liens en headers"
        ]
      },
      "acceptanceCriteria": [
        "On mobile (sm and below), users can still navigate via the existing bottom navigation.",
        "On desktop/tablet (sm and above), the header shows the added navigation links and they correctly route to existing pages.",
        "No routes are changed; existing pages (/chat, /events, /community, /leaderboard, /partners, /profile, /admin) continue to work as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit any immutable paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep the backend as a single Motoko actor (no architectural changes)."
  ],
  "nonGoals": [
    "Do not re-implement events creation or the live guestbook/chat features; they already exist.",
    "Do not add new backend methods or change backend data schemas for this request.",
    "Do not add new pages or change route paths; only navigation discoverability in the header is in scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}