{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add authenticated/onboarded header navigation links for Events and Chat",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Show primary header navigation links (including Events and Chat) for authenticated users who completed onboarding, without changing access rules.",
      "acceptanceCriteria": [
        "When a user is authenticated and has completed onboarding, the top header displays navigation links that include at least: “Events” (route: /events) and “Chat” (Community Guestbook; route: /chat).",
        "The header navigation uses English labels and is visually consistent with the existing navigation styling (active vs inactive state).",
        "When the user is not authenticated and/or not onboarded, these community navigation links do not appear in the header (current access rules remain unchanged)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Add a header (top AppShell) navigation section that renders for canAccessCommunity (authenticated + onboardingComplete) and includes at least links to /events (\"Events\") and /chat (\"Chat\"). Reuse existing nav styling patterns (active vs inactive) already used by the desktop/bottom navigation, and keep labels in English. Ensure links remain hidden when not authenticated and/or not onboarded."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Keep navigation responsive: preserve mobile bottom navigation and show header links on larger screens without breaking existing routes.",
      "acceptanceCriteria": [
        "On mobile (sm and below), users can still navigate via the existing bottom navigation.",
        "On desktop/tablet (sm and above), the header shows the added navigation links and they correctly route to existing pages.",
        "No routes are changed; existing pages (/chat, /events, /community, /leaderboard, /partners, /profile, /admin) continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Adjust responsive layout so the added navigation links are visible in the header on sm and above while keeping the existing mobile bottom nav behavior on sm and below. If the existing desktop navigation is removed, do so only by intentionally replacing it with the new header navigation (no route/path changes). Also ensure active-state logic remains correct for nested routes (e.g., event detail under /events) without altering any route definitions."
        }
      ]
    }
  ]
}