{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Live Guestbook: allow authors to delete their own messages (UI) and keep admin moderation delete working",
  "requirements": [
    {
      "id": "REQ-56",
      "summary": "Add an author-only delete control to the Live Guestbook feed that confirms, calls removeMessage, and updates the feed immediately with clear English errors on failure.",
      "acceptanceCriteria": [
        "For each message in the guestbook feed, if the current user is the message author, a clearly visible delete button/control is shown.",
        "Clicking delete asks for confirmation (English) before performing the deletion.",
        "After a successful delete, the message disappears from the visible feed without requiring a manual page refresh.",
        "If deletion fails, the user sees an English error toast/message (e.g., 'Failed to delete message. Please try again.')."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Add a per-message delete button that only renders when the current authenticated user is the message author (compare message.author to the current principal). Use the existing RequireAuth + RequireOnboarding gating and call the existing remove-message mutation with an English confirm dialog; show English success/error feedback via the existing toast system. Use the authorization component’s frontend guidance to derive the current principal/identity for author comparison; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useChat.ts",
          "operation": "modify",
          "description": "Enhance the existing useRemoveMessage mutation to update the react-query cache so the deleted message is removed from the visible feed immediately after success (and/or optimistically with rollback on error), while still invalidating/revalidating the relevant message queries."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Ensure the admin chat moderation panel can still delete any message with the same English confirmation and success/error feedback, and refreshes lists after success.",
      "acceptanceCriteria": [
        "An admin can still remove any message via the moderation panel.",
        "The moderation panel’s delete action continues to refresh the message lists after success.",
        "No new authorization errors occur for admins when deleting messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ChatModerationPanel.tsx",
          "operation": "modify",
          "description": "Verify the moderation panel continues to use the existing remove-message mutation, retains the English confirmation prompt, and provides English success/error toasts. Ensure the UI remains resilient to authorization failures (showing the existing error toast) and that the message list refresh behavior is preserved after successful deletion."
        },
        {
          "path": "frontend/src/hooks/useChat.ts",
          "operation": "modify",
          "description": "Ensure any immediate/optimistic cache updates added for removeMessage also work for the admin moderation view (allMessages) so admin deletions reflect promptly and continue to refresh the relevant lists after success."
        }
      ]
    }
  ]
}